JohnDavidLopez14/TM4C_Space_Invaders_Clone/main.c
// Required Hardware I/O Connections
// Slide pot pin 1 connected to ground
// Slide pot pin 2 connected to PE2/AIN1
// Slide pot pin 3 connected to +3.3V 
// fire button connected to PE0
// special weapon fire button connected to PE1
// 8*R resistor DAC bit 0 on PB0 (least significant bit)
// 4*R resistor DAC bit 1 on PB1
// 2*R resistor DAC bit 2 on PB2
// 1*R resistor DAC bit 3 on PB3 (most significant bit)
// LED on PB4
// LED on PB5

// Purple Soldered Electronics Nokia 5110
// --------------- (assumes you are facing it, going left to right)
// Signal         (Nokia 5110) LaunchPad pin
// Backlight      (LED, pin 1)  3.3V or GPIO
// Output Enable  (OE,  pin 2)  3.3V
// Reset          (RST,  pin 3) PA7
// SSFI0Fss       (CS, pin 4)   PA3
// Data/Command   (DC, pin 5)   PA6
// SSI0Tx         (MOSI, pin 6) PA5
// SSI0Clk        (CLK,  pin 7) PA2
// Ground         (GN pin 8)    ground
// 3.3V           (VCC, pin 9)  3.3V

// Pinout Summary
// Port A   - SSI/Nokia 5110    - Nokia5110.h
// PA2      - SSI0Clk           - Nokia5110.h
// PA3      - SSI0Fss           - Nokia5110.h
// PA4      -  N/A (not initialized since we are not using SSI0Rx)
// PA5      - SSI0Tx            - Nokia5110.h
// PA6      - GPIO, output      - Nokia5110.h
// PA7      - GPIO, output      - Nokia5110.h

// Port B
// PB0 - GPIO, output - DAC.h
// PB1 - GPIO, output - DAC.h
// PB2 - GPIO, output - DAC.h
// PB3 - GPIO, output - DAC.h
// PB4 - GPIO, output - LED.h
// PB5 - GPIO, output - LED.h

// Port E
// PE0 - GPIO, input, pull up - Buttons.h
// PE1 - GPIO, input, pull up - Buttons.h
// PE2 - AIN1, ADC

// ISR Priority
// Systick - Priority 2
// GPIOPORTE - Priority 3
// Timer0A - Priority 4
// Timer1A - Priority 5
// Timer2A - Priority 6
// Timer3A - Priority 7

// Include macros
// library
#include <stdint.h>
#include <stddef.h>
#include <stdio.h>
#include <stdbool.h>
// hardware
#include "hardware/tm4c123gh6pm.h"
#include "hardware/ADC.h"
#include "hardware/Buttons.h" // Timer 2A, 32 bits
#include "hardware/LED.h" // Timer 3A, 32 bis
#include "hardware/PLL.h" // this is fine, but double check to see if 80Mhz is correct for this lab
#include "hardware/Sound.h" // Timer 0A, 32 bit
#include "hardware/SysTick.h"
#include "hardware/Nokia5110.h"
#include "hardware/UART.h"
// game logic
#include "gameLogic/bitmaps.h"
#include "gameLogic/enemies.h" // Timer 1A, 32 bit, Timer2A 32 bit
#include "gameLogic/player.h"
#include "gameLogic/projectile.h"
#include "gameLogic/random.h"

// Constant macros
#define PB4 (1 << 4)
#define PB5 (1 << 5)
#define H_MARGIN 4 // penetration margin
#define V_MARGIN 5 

// Function Prototypes
void DisableInterrupts(void);
void EnableInterrupts(void);

// Globals
const uint32_t LED1 = PB4;
const uint32_t LED2 = PB5;
static Player *PlayerShip;
static Projectile **Missiles;
static Projectile **Lasers;
static Enemy **Enemies;

// State Alias
typedef enum {Init,Reset, Game, End} State;

// State function prototypes
State Initialize_Handler(void);
State Reset_Handler(void);
State Game_Handler(void);
State End_Handler(void);

// State Table
typedef State (*stateHandler) (void); // this is how you alias function pointers apparently
stateHandler StateTable[] = {
  Initialize_Handler,
  Reset_Handler,
  Game_Handler,
  End_Handler
};

// Main

int main(void){
  State current = Init;
  while(1){
    current = StateTable[current]();
  }
}

// Initialization

void Hardware_Init(void){
  UART_Init();
  PLL_Init(); // set to 80 mHz
  Nokia5110_Init();
  Sound_Init(); // initializes PB0:3 for DAC output, also initializes Timer0A for interrupts
  LED_Init(); // initialize PB4:5 for LED output
  Buttons_Init(); // initialize PE0:1 for falling edge interrupts, not complete yet
  ADC0_Init();  // initialize ADC on PE2 / AIN1
}

void Software_Init(void){
  Random_Init(1);

  // Player Initialization
  Player_Init();
  PlayerShip = Get_Player();
  SysTick_Init(PlayerShip);

  // Enemy Initialization
  Enemies_Init();
  Enemies = Get_Enemies();
  
  // Projectile Initialization
  Projectile_Init(PlayerShip);
  Missiles = Get_Missiles(); // returns a null terminated array
  Lasers = Get_Lasers(); // returns a null terminated array
};

State Initialize_Handler(void){
  Hardware_Init();
  Software_Init();
  return Game;
}

// Reset

// Game

void Poll_Inputs(void){
    if (XposFlag) {
      XposFlag = false;
      PlayerShip->xPos = Xpos;
    }

    if (MissileFlag){
      MissileFlag = false;
      Fire_Missile();
    }

    if (LaserFlag){
      LaserFlag = false;
      Fire_Laser();
    }
}

void Update_Game_State(void){
  Update_Missile_Position();
  Update_Laser_Position();
  Update_Enemies_Position();
}

void Check_OOB(void){
  Check_Lasers_OOB();
  Check_Missiles_OOB();
}

void Draw_State(void){
  // Player Ship
  Nokia5110_PrintBMP(PlayerShip->xPos, PlayerShip->yPos, PlayerShip->sprite->bmp, 0);

  // sEnemies
  for (int i = 0; Enemies[i] != NULL; i++){
    if (Enemies[i]->active)
      Nokia5110_PrintBMP(Enemies[i]->xPos, Enemies[i]->yPos, Enemies[i]->sprite->bmp, 0);
  }

  // Missiles
  for (int i = 0; Missiles[i] != NULL; i++)
  {
    if (Missiles[i]->active)
      Nokia5110_PrintBMP(Missiles[i]->xPos, Missiles[i]->yPos, Missiles[i]->sprite->bmp, 0);
  }

  // Lasers
  for (int i = 0; Lasers[i] != NULL; i++){
    if (Lasers[i]->active)
      Nokia5110_PrintBMP(Lasers[i]->xPos, Lasers[i]->yPos, Lasers[i]->sprite->bmp, 0);
  }
}

bool BitmapsOverlap(Enemy *enemy, Projectile *projectile, int hMargin, int vMargin)
{
  int aLeft, aRight, aTop, aBottom, bLeft, bRight, bTop, bBottom;
  aLeft = enemy->xPos + hMargin;
  aRight = enemy->xPos + enemy->sprite->width - hMargin;
  aTop = enemy->yPos - enemy->sprite->height + vMargin;
  aBottom = enemy->yPos - vMargin;

  bLeft = projectile->xPos;
  bRight = projectile->xPos + projectile->sprite->width;
  bTop = projectile->yPos - projectile->sprite->height;
  bBottom = projectile-> yPos;
  return (
    aLeft <= bRight &&
    aRight >= bLeft &&
    aTop <= bBottom &&
    aBottom >= bTop
  );
}

void Check_Collisions(void){
  for(int x = 0; Enemies[x] != NULL; x++){
    if(!Enemies[x]->active)continue;

    for(int y = 0; Lasers[y] != NULL; y++){
      if (!Lasers[y]->active) continue;

      if (BitmapsOverlap(Enemies[x], Lasers[y], H_MARGIN, V_MARGIN)){
              Enemies[x]->active = false;
              Lasers[y]->active = false;
              // need to add score here
      }  
    }

    for(int z = 0; Missiles[z] != NULL; z++){
      if(!Missiles[z]->active) continue;

      if (BitmapsOverlap(Enemies[x], Missiles[z], H_MARGIN, V_MARGIN)){
              Enemies[x]->active = false;
              Missiles[z]->active = false;
              // need to add score here
      }  
    }
  }
}

State Game_Handler(void){
  // testing
  Spawn_Enemies(4, &smallEnemy10Point_Enemy, smallEnemy10Point_Enemy.sprite->height * 1);
  Spawn_Enemies(3, &smallEnemy20Point_Enemy, smallEnemy20Point_Enemy.sprite->height * 2);
  Spawn_Enemies(2, &smallEnemy30Point_Enemy, smallEnemy30Point_Enemy.sprite->height * 3);
  EnableInterrupts();
  while(1){ // main code logic
    Poll_Inputs(); // Read Inputs
    Update_Game_State();// Update Game State
    Check_OOB(); // check out of bounds
    Check_Collisions();
    Draw_State(); // draw everything

    // Display Graphics
    Nokia5110_DisplayBuffer();
    Nokia5110_ClearBuffer();
    if (PlayerShip->health <= 0){
      return End;
    }
  }
}

// End
State End_Handler(void){
  return Reset;
}